Revit API Introduction Labs
Lab2_0_CreateLittleHouse Class
 Create a little house with some sample building elements. We create a simple building consisting of four walls, a door, two windows, a floor, a roof, a room and a room tag.
 This lab's external command creates a simple building containing four walls, two windows, a door, a floor, a roof and a room. Commands defined in the following labs can run on this model. This lab needs to make use of some features which will not be discussed fully until later on.
 This lab makes use of the utility class LabUtils which is provided in the exercise project and includes various reusable helper functions. In the following labs, further utilities will be added to this class. It also uses some constants defined by the LabConstants class:
CopyC#
public const double MeterToFeet = 3.2808399;
public const double DegreesToRadians = System.Math.PI / 180;
CopyVB.NET
Public Const MeterToFeet As Double = 3.2808399
Public Const DegreesToRadians As Double = System.Math.PI / 180
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_0_CreateLittleHouse : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_0_CreateLittleHouse _
	Implements IExternalCommand
Visual C++
public ref class Lab2_0_CreateLittleHouse : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab2_0_CreateLittleHouse
See Also
Lab2_0_CreateLittleHouse Members
Labs Namespace